{
  "backend/main.mo": "Motoko canister managing user profiles and trading data with access control, supporting capital/target updates and trade recording.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten short summaries of frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication state, layout, theming, and rendering the trading dashboard.",
  "frontend/src/components/AuthControls.tsx": "Login/logout button managing Internet Identity authentication with toast feedback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting authenticated users without profiles to enter and save their name.",
  "frontend/src/features/trading/components/CapitalEditor.tsx": "UI for editing trading capital, validating input, and saving via authenticated mutation or session state.",
  "frontend/src/features/trading/components/InvestPresets.tsx": "Provides preset investment buttons and a custom input field to select an investment amount.",
  "frontend/src/features/trading/components/MetricsPanel.tsx": "Displays key trading metrics such as capital, profit, loss, and remaining target using formatted cards.",
  "frontend/src/features/trading/components/ResetTradingDataButton.tsx": "Button with confirmation dialog to reset all trading data via mutation or session reset.",
  "frontend/src/features/trading/components/TargetProfitEditor.tsx": "UI for editing target profit, showing remaining target and saving changes via mutation or session state.",
  "frontend/src/features/trading/components/TradeEntry.tsx": "Component for recording a trade by selecting investment and outcome, with validation and profit/loss preview.",
  "frontend/src/features/trading/components/TradeHistory.tsx": "Renders a sortable table of past trades with timestamps, outcomes, and profit/loss values.",
  "frontend/src/features/trading/hooks/useTradingData.ts": "React Query hooks for fetching and mutating trading data, including capital, target, trades, resets, and user profiles.",
  "frontend/src/features/trading/state/useTradingSession.ts": "Zustand store managing trading capital, targets, trade history, and profit/loss updates with win/loss logic.",
  "frontend/src/features/trading/TradingDashboard.tsx": "Main trading view that loads metrics, editors, trade entry, history, and reset controls based on auth status.",
  "frontend/src/features/trading/utils/tradingMath.ts": "Utility functions for calculating win profit/returns, target remaining, and currency formatting.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the current Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hooks for managing Internet Identity login state, stored identities, and auth-client behavior.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables defining light and dark theme color tokens and layout settings.",
  "frontend/src/main.tsx": "App entry that sets up React Query, Internet Identity provider, and renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining themes, colors, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing scope, features, architecture notes, and versioned requirements for the trading app."
}